urbafoam/templates/0.orig/U_simpleFoam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

#include        "include/initialConditions";

internalField   uniform $flowVelocity;

boundaryField
{
    #include "include/ABLConditions"

    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        flowDir		    $windDirection;
        zDir		    $zDirection;
        Uref            $Uref;
        Zref            $Href;
        z0              $z0;
        d               $zGround;
        zGround         $zGround;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    ground {
        type slip;
    }


    ".*"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    #include    "include/setConstraintTypes"

}