urbafoam/templates/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
#include        "include/initialConditions"

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type             fixedValue;
        value            $internalField;
//        type            totalPressure;
//        p0              uniform 0;
//        gamma           1.4;
//        value           uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }

    #include    "include/setConstraintTypes"

}

// ************************************************************************* //
