urbafoam/templates/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

Uinlet               ({{refSpeed}} 0 0);

flowVelocity         (0 0 0);
pressure             0;
turbulentKE          {{turbulentKE}};
turbulentEpsilon     {{turbulentEpsilon}};
// ************************************* //
