urbafoam/templates/0.orig/include/setConstraintTypes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

cyclic
{
    type  cyclic;
}

cyclicAMI
{
    type  cyclicAMI;
}

cyclicACMI
{
    type  cyclicACMI;
}

cyclicSlip
{
    type  cyclicSlip;
}

empty
{
    type  empty;
}

nonuniformTransformCyclic
{
    type  nonuniformTransformCyclic;
}

processor
{
    type  processor;
}

processorCyclic
{
    type  processorCyclic;
}

symmetryPlane
{
    type  symmetryPlane;
}

symmetry
{
    type  symmetry;
}

wedge
{
    type  wedge;
}


// ************************************************************************* //