urbafoam/templates/0.orig/k_potentialFoam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// kInlet          1.5;   // approx k = 1.5*(I*U)^2 ; I = 0.1

dimensions      [0 2 -2 0 0 0 0];
#include        "include/initialConditions"


internalField   uniform $turbulentKE;

boundaryField
{
    #include        "include/ABLConditions"
    inlet
    {
        type            atmBoundaryLayerInletK;
        flowDir		    $windDirection;
        zDir		    $zDirection;
        Uref            $Uref;
        Zref            $Href;
        z0              $z0;
        d               $zGround;
        zGround         $zGround;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ".*"
    {
        type            slip;
    }
    #include    "include/setConstraintTypes"
}

// ************************************************************************* //
