urbafoam/templates/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 0.001;
        value           uniform 0.0;
    }

    other
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform {{z0_other}}; // other patch roughness than walls.
        value           uniform 0.0;
    }

    ground 
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform {{z0}}; 
        value           uniform 0.0;
    }

    #include    "include/setConstraintTypes"
}
// ************************************************************************* //
