urbafoam/templates/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{

    default         Gauss linear;
    grad(U)         cellLimited Gauss linear {{gradLimit_U}};
    grad(p)         cellLimited Gauss linear {{gradLimit_p}};
    grad(k)         cellLimited Gauss linear {{gradLimit_k}};
    grad(epsilon)   cellLimited Gauss linear {{gradLimit_epsilon}};
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linearUpwindV grad(U);

    turbulence      bounded Gauss limitedLinear 1;
    div(phi,k)      bounded Gauss linearUpwind grad(k);
    div(phi,epsilon) bounded Gauss linearUpwind grad(epsilon);
    div(phi,R)      $turbulence;

    div(R)          Gauss linear;
    div(phi,nuTilda) bounded Gauss limitedLinear 1;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default             limited corrected 0.33;
}

fluxRequired
{
    default         no;
    p;
}
wallDist
{
    method meshWave;
}

// ************************************************************************* //
