urbafoam/templates/system/readFields
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

readFields
{
    functionObjectLibs ("libfieldFunctionObjects.so");
    type            readFields;
    fields          (p U k);
}