urbafoam/templates/system/sampleDict_pointcloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

interpolationScheme	cellPoint;
setFormat raw;
type sets;
libs ("libsampling.so");

sets
(
{{#pointClouds}}
    {{name}}
    {
        type cloud;
        axis xyz;
        points {{samplePoints}}
    }
{{/pointClouds}}
);

fields
(
    U
    k
    p
);

