urbafoam/templates/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

{{#buildingModels}}
surfaces ("{{filename}}");
{{/buildingModels}}


extractionMethod     extractFromSurface;

extractFromSurfaceCoeffs
{
    includedAngle    {{includedAngle}};
    geometricTestOnly no;
}

subsetFeatures
{
    nonManifoldEdges yes;
    openEdges        yes;
}

trimFeatures
{
    minElem          0;
    minLen           0;
}

writeObj             yes;


// ************************************************************************* //
